[
  {
    "userData": {
      "userId": 1,
      "userName": "Juanito Alimaña",
      "avatarUrl": "https://avatars.githubusercontent.com/u/1?v=4"
    },
    "postId": 1,
    "createAt": "2021-09-01T00:00:00Z",
    "description": {
      "title": "Mi primer post sobre React",
      "content": "En este post quiero compartir un poco sobre mis primeros pasos con React. Estoy aprendiendo a construir interfaces dinámicas y he comenzado a trabajar en proyectos más complejos como formularios interactivos y navegación entre páginas sin necesidad de recargar la página. He estado experimentando con hooks, como useState y useEffect, para manejar el estado y los efectos secundarios, lo que ha mejorado mi comprensión sobre cómo React maneja la reactividad y las actualizaciones del DOM. Cada vez me siento más cómodo con la librería y estoy emocionado por seguir avanzando y crear aplicaciones más completas.",
      "imageUrl": "https://img.freepik.com/foto-gratis/programador-bebiendo-taza-cafe-manana-mientras-construye-cortafuegos_482257-104079.jpg?t=st=1738721874~exp=1738725474~hmac=dcaca3f601a1717e54d5cc2c2ddb1650267cf0853614b2608a7153c298e1c315&w=740"
    },
    "category": ["React", "Frontend"]
  },
  {
    "userData": {
      "userId": 2,
      "userName": "Carlos Antonio",
      "avatarUrl": "https://avatars.githubusercontent.com/u/2?v=4"
    },
    "postId": 2,
    "createAt": "2021-09-01T00:00:00Z",
    "description": {
      "title": "Explorando el universo con JavaScript",
      "content": "Hoy quiero hablar sobre cómo JavaScript puede ayudarte a visualizar datos de manera interesante. Hay muchas librerías poderosas para hacerlo, como D3.js, Chart.js y Three.js. Con ellas, puedes crear visualizaciones interactivas de datos o incluso representar gráficos en 3D. Me he estado enfocando en cómo transformar datos en gráficos dinámicos que se adaptan a las necesidades de los usuarios, lo que me ha permitido entender mejor cómo gestionar grandes volúmenes de datos de manera efectiva y visualmente atractiva. Además, he comenzado a integrar estas visualizaciones en proyectos web, lo que ha sido una experiencia increíblemente gratificante.",
      "imageUrl": "https://img.freepik.com/foto-gratis/vista-superior-pirata-informatico-irreconocible-que-realiza-ciberataque-noche_1098-18706.jpg?t=st=1738721542~exp=1738725142~hmac=0e76013e8cd6570960340c92fa05618617f570f799f4f016f6e6e754fa51656d&w=740"
    },
    "category": ["JavaScript", "Data Visualization"]
  },
  {
    "userData": {
      "userId": 3,
      "userName": "Maria de los Ángeles",
      "avatarUrl": "https://avatars.githubusercontent.com/u/3?v=4"
    },
    "postId": 3,
    "createAt": "2021-09-01T00:00:00Z",
    "description": {
      "title": "Mis vacaciones en Costa Rica",
      "content": "Acabo de regresar de unas vacaciones increíbles en Costa Rica. Aquí comparto una foto de la playa que visité. Durante mi estancia, exploré muchas de las maravillas naturales del país, desde sus playas tropicales hasta sus parques nacionales llenos de biodiversidad. Costa Rica tiene una energía única, y la gente es increíblemente acogedora. Pude realizar actividades como el senderismo en el volcán Arenal y disfrutar de las aguas termales. También tomé muchas fotos de la fauna local, como aves exóticas y monos, lo que me permitió mejorar mis habilidades en fotografía de naturaleza. Sin duda, volveré a este paraíso verde.",
      "imageUrl": "https://img.freepik.com/foto-gratis/naturaleza-turismo-personas-joven-turista-descalzo-jeans-cortos-mochila-sentado-gran-roca-interior-selva-verde_273609-1610.jpg?t=st=1738721991~exp=1738725591~hmac=043597bac29bc6140b9ef47726d68e50255721eb444bd438096bfc43ee00a01c&w=1380"
    },
    "category": ["Travel", "Photography"]
  }
]